Repository: hellotunamayo/macLlama
Catalog: Localizable.xcstrings
Source language: en
Languages: ja, ko

source: %@'s think
ja: %@の思考
ko: %@모델의 추론 과정

source: %lld models available
ja: %lld モデルが利用できます。
ko: %lld개의 모델 사용 가능

source: %lldpt
ja: %lldポイント
ko: %lld포인트

source: Add Model from Ollama.com
ja: Ollama.com からモデルを追加
ko: Ollama.com 에 있는 모델 추가하기

source: Adjusting 'temperature' and 'num_predict' can significantly impact the model's output. Higher temperatures lead to more creative, but potentially less predictable, responses. A larger 'num_predict' may result in longer, more verbose outputs, and can also increase processing time. Experiment with caution.
ja: 'temperature' や 'num_predict' の設定を変更すると、モデルの出力が変わることがあります。'temperature' を高くすると、より面白い、でも予測しづらい回答になることがあります。'num_predict' を大きくすると、長い、詳しくなったり、処理に時間がかかることがあります。試す際は注意してください。
ko: 'temperature'와 'num_predict' 값을 조정하는 것은 모델 출력 결과에 큰 영향을 미칠 수 있습니다. 'temperature' 값이 높을수록 더 창의적이지만 예측 불가능한 응답이 나올 수 있습니다. 'num_predict' 값이 클수록 응답이 길고 자세해질 수 있지만, 처리 시간 또한 증가할 수 있습니다. 신중하게 설정하시기 바랍니다.

source: Advanced Settings
ja: 上級設定
ko: 고급 설정

source: An error occurred while processing your request. Please try again later.
ja: リクエストの処理中にエラーが発生しました。
ko: 오류가 발생하여 요청 처리에 실패했습니다. 이후에 다시 시도해 주세요.

source: Ask something (⌘ + return to send)
ja: 何か質問してください(⌘ + return で送信)
ko: 무엇이든 물어보세요 (⌘+리턴으로 보내기)

source: Auto-scroll to bottom on answer completion
ja: 回答完了時に自動で下へスクロール
ko: 답변 생성 완료 시 맨 아래로 자동 스크롤

source: Automatic check for Updates
ja: アップデートの自動チェック
ko: 자동으로 업데이트 체크

source: Automatically stop Ollama server on exit
ja: 終了時に Ollama サーバーを自動停止
ko: 앱이 종료될 때 Ollama 서버도 같이 종료하기

source: Bug report or feature request
ja: バグ報告または機能要望
ko: 버그 리포트 & 기능 제안

source: Chat font size
ja: フォントサイズ
ko: 채팅 글꼴 크기

source: Chat History
ja: チャットヒストリー
ko: 채팅 히스토리

source: Check for Update
ja: アップデートを確認
ko: macLlama 업데이트

source: Clear all
ja: 全て削除
ko: 모두 삭제

source: Click here to update
ja: ここにクリックしてアップデート
ko: 눌러서 업데이트 체크

source: Connecting to server...
ja: サーバーへ接続中です...
ko: 서버에 연결 중...

source: Copied to clipboard
ja: クリップボードにコピーされました
ko: 클립보드에 복사됨

source: Copy this text to clipboard
ja: このテキストをクリップボードにコピー
ko: 이 텍스트를 클립보드로 복사하기

source: Current Model
ja: 現在のモデル
ko: 현재 선택한 모델

source: Delete
ja: 削除
ko: 지우기

source: Delete All Chat History
ja: チャットヒストリーをすべて削除してください。
ko: 모든 대화 히스토리 지우기

source: Delete All History
ja: すべてのヒストリーを削除
ko: 모든 히스토리 지우기

source: Delete model "%@"?
ja: モデル "%@" を削除
ko: “%@” 모델을 지우겠습니까?

source: Delete This History
ja: このヒストリーを削除する
ko: 현재 대화 지우기

source: Discuss macLlama on GitHub
ja: GitHub で macLlama について議論する
ko: GitHub 에서 macLlama 의견 남기기

source: Drop Images Here
ja: ここに画像をドロップしてください
ko: 여기에 이미지 올려놓기

source: Enable Markdown rendering
ja: Markdown レンダリングを有効にする
ko: 마크다운 켜기

source: Enable thinking process
ja: 思考プロセスを有効にする
ko: Thinking 프로세스 활성화

source: General
ja: 全般
ko: 일반

source: Hide Assistant Thinking
ja: アシスタントの思考を非表示にする
ko: 모델의 추론 과정 가리기

source: Host
ja: ホスト
ko: 호스트

source: If service failed to start. Verify that the Ollama server is installed and the network host is configured correctly in your preferences.
ja: もしサービスが起動しない場合は、Ollamaのサーバーがインストールされているか、設定アプリでネットワークの設定が正しいか確認してください。
ko: 서비스가 실행되지 않는다면 Ollama 서버가 설치되었는지 확인하세요. Ollama 서버가 설치되어 있다면 macLlama 환경설정에서 서버 주소가 올바르게 설정되었는지 확인해 주세요.

source: Kill Ollama server
ja: Ollama サーバーを停止する
ko: Ollama 서버 종료

source: Local Prefix & Suffix
ja: ローカル接頭辞と接尾辞
ko: 로컬 접두어 & 접미어

source: Local Prompt Prefix
ja: ローカル接頭辞
ko: 로컬 접두어

source: Local Prompt Suffix
ja: ローカル接尾辞
ko: 로컬 접미어

source: Markdown Settings
ja: Markdown 設定
ko: 마크다운 설정

source: Markdown Theme
ja: マークダウンテーマ
ko: 마크다운 테마

source: Model Management
ja: モデル管理
ko: 모델 관리

source: Model name to pull
ja: プルするモデル名
ko: 가져올 모델 이름

source: Network
ja: ネットワーク
ko: 네트워크

source: New macLlama is available!
ja: 新しい macLlama が利用可能です！
ko: 새로운 macLlama 버전이 있습니다!

source: No Chat History Found
ja: チャットヒストリーが見つかりません
ko: 채팅 히스토리가 아직 없습니다

source: num_predict (-1 for unlimited)
ja: num_predict (-1で無制限)
ko: num_predict (-1일 경우 무제한)

source: Ollama is Thinking...
ja: Ollama が考えています...
ko: Ollama가 생각 중입니다…

source: Ollama server is %@
ja: Ollama サーバー: %@
ko: Ollama 서버 상태: %@

source: Open Terminal.app
ja: Terminal.app を開く
ko: 터미널 앱 실행하기

source: Port
ja: ポート
ko: 포트

source: Prompt
ja: プロンプト
ko: 프롬프트

source: Prompt Suffix
ja: プロンプトサフィックス
ko: 프롬프트 접미어

source: Pull
ja: 引っ張る
ko: 가져오기

source: Pulling %@...
ja: %@ をプル中...
ko: %@ 가져오는 중…

source: Quit macLlama
ja: macLlama を終了
ko: macLlama 끝내기

source: Reload
ja: 再読み込み
ko: 새로고침

source: Scroll to Top
ja: 一番上へスクロール
ko: 맨 위로 이동

source: Search models from Ollama
ja: Ollamaからモデルを検索
ko: Ollama 에서 모델 찾아보기

source: Search models from Ollama.com
ja: Ollama.com からモデルを検索
ko: Ollama.com 에서 모델 찾아보기

source: Send
ja: 送信
ko: 보내기

source: Show Assistant Thinking
ja: アシスタント思考表示
ko: 모델의 추론 결과 보기

source: Show or hide assistant thinking
ja: アシスタント思考の表示/非表示
ko: 모델의 추론 결과 보기 / 숨기기

source: Start Local Ollama Server
ja: ローカルOllamaサーバーを起動
ko: 로컬 Ollama 서버를 시작

source: Start the server and go
ja: サーバーを開始して進む
ko: Ollama 서버 및 앱 시작

source: Start your local AI engine with Ollama
ja: Ollama でローカル AI エンジンを開始
ko: Ollama 와 함께 로컬 AI 엔진을 시작하세요

source: Stop Local Ollama server
ja: ローカルOllamaサーバーを停止
ko: 로컬 Ollama 서버를 종료

source: Text Example %lldpt
ja: 色は匂えど散りぬるを(%lldポイント)
ko: 본문 글꼴 크기 예시 %lld포인트

source: Thinking Process
ja: 思考プロセス
ko: 추론 프로세스

source: This action cannot be undone.
ja: この操作は取り消せません
ko: 이 동작은 되돌릴 수 없습니다.

source: This functionality is intended for use with "thinking" models, including examples like DeepSeek R1 and Qwen 3. Attempting to use unsupported models will result in an error. (Requires Ollama 0.9.0 or later)
ja: この機能は「思考」モデルでの利用を想定しており、DeepSeek R1やQwen 3のような例が含まれます。対応していないモデルを使用しようとするとエラーが発生します。(Ollama 0.9.0以降が必要です)
ko: 이 기능은 딥시크 R1 및 Qwen 3와 같은 예를 포함한 "사고" 모델에서만 사용 가능합니다. 지원되지 않는 모델에 기능을 활성화하면 오류가 발생합니다. (사용하려면 Ollama 0.9.0 이상 필요)

source: This option is for experienced users. If you're unsure, leave it at the standard setting. By default, the host is localhost and the port is 11434.
ja: このオプションは、経験者向けのものです。もしよくわからない場合は、標準設定のままにしておいてください。デフォルトでは、ホストはlocalhostで、ポートは11434です。
ko: 이 옵션은 고급 사용자용 옵션입니다. 확실하지 않다면 기본 설정으로 놓아 두세요. 기본 설정은 호스트 localhost 와 포트 11434입니다.

source: Typography
ja: タイポグラフィ
ko: 타이포그래피

source: Utility
ja: ユーティリティ
ko: 유틸리티

source: We’ve released a **new version of macLlama!** To enjoy the latest features and improvements, please update your app now.
ja: **macLlama の新バージョンをリリースしました！** 最新の機能と改善を享受するには、今すぐアプリをアップデートしてください。
ko: **macLlama의 새 버전**이 등록되었습니다. 최신 기능과 더 나은 성능을 위해 macLlama 를 업데이트 해주세요.

source: You
ja: あなた
ko: 당신

source: You are using the latest version of macLlama.
ja: 最新バージョンの macLlama を使用しています。
ko: macLlama 의 최신 버전이 실행 중입니다.

source: Host info:
ko: 호스트 정보:

source: macLlama on GitHub
ko: GitHub에서 macLlama 보기

source: macLlama Preferences
ko: macLlama 설정
